{
  "missing_params": "Es fählt nöötigi Parameter",
  "and": " und ",
  "not_a_sequence": "Oh nei, mir hei kei DNA-Sequenz als Text becho, sondern {seq}. Kei Sorge – s Problem isch bi üs!",
  "rate_limit": "Uups! Oise Gschichte-AI bruucht e churzi Pause. Z vil Aafrogä sind cho, mir hei s Limit erreicht. Probier's gli nomol!",
  "connection_error": "Oh nei! Mir hei d'Verbindig zu oisem AI-Gschichteerzähler verlore. Bitte lueg d'Internet oder probier's spöter nomol.",
  "bad_request": "Hmm, öpis an dere LEGO-Sequenz het oises System verwirrt. (Technische Info: {error})",
  "auth_error": "Oisi AI-Zugangs-Chärtli funktioniert nöd – d'Authentifizierung isch fehlgschlage. Mir müend en Mensch drum bitte.",
  "api_error": "Oise AI-Gschichteerzähler het grad e Problem. (Server-Fehler: {error}) Probier's bald nomol.",
  "unexpected_error": "Öpis Unerwartets isch passiert. Kei Sorge – s Problem isch bi üs! (Fehler: {error})",
  "blast_cached": "Sequenz im Cache gfunde, wird zrugggäh.",
  "waiting_for_results": "Warte {} Sekunde für d'Resultate vo {}...",
  "timeout": "Timeout vo %d Sekunde erreicht, während mir uf d'Resultate warte",
  "not_ready": "Nöd parat, versuech's nomol in %d Sekunde (%d Sekunde bisher)...",
  "no_hits_found": "Kei Treffer gfunde",
  "examples_search_term": "{gene} Varianten",
  "blast_started": "BLAST gestartet, warte uf d'Resultate...",
  "blast_example": "Hey, das sieht bekannt us! Dini Sequenz scheint sich mit {name} z'überlappe{variants}.",
  "variants": ", mit ein paar Varianti: {variants}",
  "no_variants": ", ohni Varianti",
  "protein_variants": ", wo z Protein änderet: {protein_variants}",
  "reflection_template": {
    "intro": {
      "general": "NEXUS Personalized Health an de ETH Züri zeigt es LEGO-DNA-Sequenzier-Demo, woni Gäst us LEGO-Stäbe tüend staplä. Dä Stapel wird mit em Scanner i e DNA-Sequenz übersetzt. {username} hät grad dä folgende Read gmacht:\n{seq}",
      "examples": "Im Rahmen vo ere edukative Demo vo NEXUS Personalized Health an de ETH Züri hät {username} grad dä folgende cDNA-Abschnitt sequenziert:\n{seq}"
    },
    "domains": ", spezifisch i äm Teil vom {domains}",
    "examples": {
      "general": "Überraschenderwiis zeigt dr BLAST-Vergleich Ähnligkeite mit genetischem Material vo dere folgende Spezies: {species}.",
      "egfr": "Tatsächlich stimmt d Sequenz mit {gene}{domain_phrase} überei. Das Gen zeigt oft aktivierendi Substitutiöne wie **p.G719S** im Exon 18 oder chlii Delätiöne im Exon 19, wo d Kinase im 'on'-Modus halte.",
      "cftr": "Tatsächlich stimmt d Sequenz mit {gene}{domain_phrase} überei, wo scho e chlini Änderig chani zu zystischer Fibrose führe. Zum Bispiel macht **p.G551D** e Kanal, wo z selten öppnet, während **p.R553*** s Protein grad abbricht.",
      "warfarin": "Tatsächlich stimmt d Sequenz mit em {gene}{domain_phrase} überei, wo d Empfindlechkeit uf s Medikament Warfarin beeinflusst. Varianti wie **VKORC1 p.V29L** chönd d Vitamin-K-Verwertig verändere, während **CYP2C9 p.I359L** oder **p.D360E** s Abbou vom Medikament verlangsame — drum chönd Standard-Dosä z stark oder z schwach sii.",
      "sars2_rbd": "Tatsächlich stimmt d Sequenz mit em SARS-CoV-2 Spike-Protein {gene}{domain_phrase} überei. Im Abwasser findemer chliini RNA-Bruchstück, wo so Mutations-'Fingerprints' enthalte — wie **E484Q** oder **S477N/S477G**. **E484Q** passt oft zu **Kappa-ähnliche** Viruse (B.1.617.1), während **S477N** typisch isch für **Iota-ähnlichi** Linige (B.1.526); **S477G** isch weniger eindeutig und brucht meh Marker. Mit so Fingerprints chamer d Virus oft scho identifiziere, bevor d klinische Genome bestätigt sind."
    },
    "variants": "I däm Fall enthält d Sequenz wichtigi Varianti: {variants}. {protein_phrase}",
    "no_variants": "I däm Fall entspricht dr Read dr kanonische Sequenz.",
    "sars_protein_variants": "Die Mutatiöne bilde e Fingerprint: {variants}.",
    "protein_variants": "Uf Proteine-Ebene führt das zu Aminosäure-Änderige: {variants}.",
    "no_protein_variants": "Die Varianti verändered s Protein nöd.",
    "role": {
      "general": "Stell der vor, du bisch e Wüsseschaftler und versuechsch z erkläre, was dä Fund chönnt bedeute.\nSchriib e leichtherzigi Reflexion uf Schwiizerdütsch— halb wüsseschaftlichs Gedankespiel, halb humorvolli Spekulation — maximal 5 Sätz.\nFokusier vor allem uf d überraschendi Mischung vo Spezies i dä BLAST-Treffer und uf die schräge Verbindige, wo mer chönnt zie.\nWenns passt, chasch höchstens ei Anspielig uf d'Schwiiz, d ETH Züri oder möglicha NEXUS-Projäkt mache — aber nur, wenn s vo de Spezies inspiriert wird.\nDr Ton söll überleitig, leicht schelmisch und guet verständlich für alli sii.\nVermeid Fantasie-Gschichtli, aber erlaube dir spielerischi Gedankesprüng, wo Neugier wecke.",
      "examples": "Stell der vor, du bisch e Wüsseschaftler und versuechsch z erkläre, was dä Fund chönnt bedeute.\nSchriib e wissenschaftlichi Reflexion uf Schwiizerdütsch, maximal 5 Sätz.\nFokusier uf das konkrete Sequenz-Stück und sini Varianti, nöd uf d Sequenzier-Demo.\nDenk dra: Das isch für e edukativi Demo — drum söll dr Ton klar, überleitig und verständlich für alli sii."
    }
}
}
  