{
  "missing_params": "Es fählt nöötigi Parameter",
  "not_a_sequence": "Oh nei, mir hei kei DNA-Sequenz als Text becho, sondern {seq}. Kei Sorge – s Problem isch bi üs!",
  "rate_limit": "Uups! Oise Gschichte-AI bruucht e churzi Pause. Z vil Aafrogä sind cho, mir hei s Limit erreicht. Probier's gli nomol!",
  "connection_error": "Oh nei! Mir hei d'Verbindig zu oisem AI-Gschichteerzähler verlore. Bitte lueg d'Internet oder probier's spöter nomol.",
  "bad_request": "Hmm, öpis an dere LEGO-Sequenz het oises System verwirrt. (Technische Info: {error})",
  "auth_error": "Oisi AI-Zugangs-Chärtli funktioniert nöd – d'Authentifizierung isch fehlgschlage. Mir müend en Mensch drum bitte.",
  "api_error": "Oise AI-Gschichteerzähler het grad e Problem. (Server-Fehler: {error}) Probier's bald nomol.",
  "unexpected_error": "Öpis Unerwartets isch passiert. Kei Sorge – s Problem isch bi üs! (Fehler: {error})",
  "blast_cached": "Sequenz im Cache gfunde, wird zrugggäh.",
  "waiting_for_results": "Warte {} Sekunde für d'Resultate vo {}...",
  "timeout": "Timeout vo %d Sekunde erreicht, während mir uf d'Resultate warte",
  "not_ready": "Nöd parat, versuech's nomol in %d Sekunde (%d Sekunde bisher)...",
  "no_hits_found": "Kei Treffer gfunde",
  "examples_search_term": "{gene} Varianten",
  "blast_started": "BLAST gestartet, warte uf d'Resultate...",
  "blast_example": "Hey, das sieht bekannt us! Dini Sequenz scheint sich mit {name} z'überlappe, mit einige Varianten: {variants}",
  "reflection_template": "Zum 10-Jahres-Jubiläum vo NEXUS Personalised Health an dr ETH Zürich zeiged mir es spielerischs Demo mit eme LEGO EV3-basiärte DNA-Sequänzer.\n\n{username}, es Gäst vom Jubiläumsfäscht, het grad es LEGO-Türmli baut, und dr Sequänzer het d’Farbekombination i die DNA-Sequenz übersetzt: \n{seq}\n\n{example}\n\nStell der jetzt vor, du bisch e Wüsseschafter*in, wo das Fundstück erläuteret.\nSchriib e locker-lustigi Reflexion – es bitzeli wissenschaftlichs Grüble, es bitzeli humorvolli Spekulation, höchstens 5 Sätz.\nDu chasch drüber spekuliere, wo d’Sequenz chönnt härcho, villicht irgendwo us em Raum Züri oder i de Schwiiz.\nD’Ton soll überleit, e chli schmunzlig, und für alli guet verständlich sii. Schriib **unbedingt i Mundart (Schwiizerdütsch)** – kei Hochdütsch.\nVermeid Fantasy-Gschichte, aber du dörfsch gern uf spielerischi Gedanke spränge, wo Neugierig machä.",
  "examples": {
    "general": "Überraschenderwiis zeigt dr BLAST-Verglich Ähnlichkeite mit genetischem Material vo folgnde Arte: {species}.",
    "egfr": "D’Sequenz passt zur EGFR-Gen, genau im Kinase-Bereich (Exone 18–19), wo hüfig wichtigi Verändrigä ufträte. Zu dene ghöred z. B.: • G719X (G719A/C/S) im Exon 18 – chliini “Schaltchraube” bim ATP-Bindigs-Ort, wo dr Motor a bitz anders lauft, • E709K oder E709_T710delinsD – Ändrig bim “Scharnier” vo dr Struktur, • klassischi Exon-19-Deletionen (z. B. E746_A750del, L747_A750insP, L747_T751del) – chliini Loop-Stückli, wo d’Kinase meh “a” schaltet. In dim Fall het’s follgendi Variante: {variants}. Uf Protein-Ebeni isch d’beobachtet Aminosäure-Sequenz ({aa_seq_q}) anders als d’Referenz ({aa_seq_r}), aafangend bi Position {aa_offset}. So Verändrigä chönd d’EGFR-Signali beeinflusse und au e Hinweis für Diagnostik oder Therapie sii.",
    "cftr": "D’Sequenz passt zum CFTR-Gen, wo bi Verändrigä zu Cystischer Fibrose führt – es Krankheitsbild, wo d’Chlorid-Transport stört, zäh Schleim bildt und zu Lunge- und andere Organ-Problem führt. I enem chline Abschnitt vom Exon 10 chönd mehri nahe beieinanderliegende Variante ufträte: • Faltungs-Defekt (ΔF508-ähnlich) – s’Protein klappt sich nöd richtig, • Gating-Defekt (G551D-ähnlich) – s’Protein isch da, aber öppis blockiert s’Uf- und Zuegah, • Spleiss-Veränderig – s’Protein wird gar nöd oder nur chlii produziert. In dim Fall het’s follgendi Variante: {variants}. Uf Protein-Ebeni isch d’beobachtet Aminosäure-Sequenz ({aa_seq_q}) anders als d’Referenz ({aa_seq_r}), aafangend bi Position {aa_offset}. So Veränderige chönd dr CFTR vo funktionstüchtig zu fehlerhaft oder inaktiv verändere. Heutig Therapie richtet sich immer meh nach dr Art vo dr Mutation – z. B. “Corrector” für d’Faltig und “Potentiator” fürs Gating – und macht CFTR zu enem Paradebeispiel für personalisiereti Medizin.",
    "warfarin": "D’Sequenz passt zum {gene}-Gen, wo e wichtigi Roll bi dr Empfindlichkeit uf s’Blutverdünnungs-Mittel Warfarin spielt. Veränderige im VKORC1 (AA 28–46) chönd d’Vitamin-K-Reduktase so verändere, dass sie Vitamin K weniger oder meh effizient recyclet – das wirkt sich uf d’Blutgerinnig uus. Veränderige im CYP2C9 (AA 355–363) chönd d’Abbau-Gschwindigkeit vo Warfarin verändere, und so wie lang s’Mittel im Körper wirkt. In dim Fall het’s follgendi Variante: {variants}. Uf Protein-Ebeni isch d’beobachtet Aminosäure-Sequenz ({aa_seq_q}) anders als d’Referenz ({aa_seq_r}), aafangend bi Position {aa_offset}. So Veränderige chönd e Standard-Dosierig z’starch (Blutigs-Risiko) oder z’schwach (Gerinnigs-Risiko) mache – drum wird Warfarin hüt oft genetisch dosiert.",
    "sars2_rbd": "D’Sequenz passt zum Spike-Protein vom SARS-CoV-2-Virus, und zwar im RBD-Abschnitt (Rezeptor-Bindigs-Domän), wo für d’Bindig a d’ACE2-Rezeptore und d’Immunerkennig wichtig isch. Im Abwasser-Monitoring luegt me gezielt uf so Schlüsselmuta­tione, will d’genomischä Schnipsel vo ville Lüüt chömed und oft unvollständig sind. Mutationen im RBD chönd verschidnigs bewirke – z. B. K417T/N, L452R/Q, E484K/Q, F490S, N501Y – aber zäme ergä sie e eindeutigs “Fingerprint” für e Variante. In dim Fall het’s follgendi Mutatione: {variants}. Bekannti RBD-Fingerprint (AA 417–554) sind zum Bispil: • Alpha (B.1.1.7): N501Y • Beta (B.1.351): K417N, E484K, N501Y • Gamma (P.1): K417T, E484K, N501Y • Delta (B.1.617.2): L452R, T478K • Omicron (BA.1): G339D, S371L, S373P, S375F, K417N, N440K, G446S, S477N, T478K, E484A, Q493R, G496S, Q498R, N501Y, Y505H • Mu (B.1.621): R346K, E484K, N501Y • Iota (B.1.526): E484K • Lambda (C.37): L452Q, F490S. Uf Protein-Ebeni isch d’beobachtet Aminosäure-Sequenz ({aa_seq_q}) anders als d’Referenz ({aa_seq_r}), aafangend bi Position {aa_offset}. So Fingerprints erlaube s’Monitoring vo mehri Variante im Abwasser und hälfed, neui Stämme z’entdecke, bevor sie i de klinische Diagnostik uufträted."
  }
}
  