{
  "missing_params": "Missing required parameters",
  "and": ", and ",
  "not_a_sequence": "Eh, somehow we did not get a DNA sequence string, but {seq}. No worries—it’s not you, it’s us!",
  "rate_limit": "Oops! Our storytelling AI needs a short break. Too many requests came in, and we hit the free usage limit. Try again in a moment!",
  "connection_error": "Uh-oh! We lost connection to our AI story generator. Please check the internet or try again in a few seconds.",
  "bad_request": "Hmm, something about this LEGO sequence confused our system. (Technical note: {error})",
  "auth_error": "Looks like our AI key card didn’t work—authentication failed. We’ll need a human to look into this.",
  "api_error": "Our AI storyteller is having a moment. (Server error: {error}) Please try again soon.",
  "unexpected_error": "Something unexpected happened. No worries—it’s not you, it’s us! (Error: {error})",
  "blast_cached": "Sequence found in cache, returning it.",
  "waiting_for_results": "Waiting {} seconds for BLAST results for {} to be ready...",
  "timeout": "Timeout of %d seconds reached while waiting for results",
  "not_ready": "Not ready, trying again in %d seconds (%d seconds so far)...",
  "no_hits_found": "No hits found",
  "examples_search_term": "{gene} variants",
  "blast_started": "BLAST started, waiting for results...",
  "blast_example": "Hey, that looks familiar! Your read seems to align to {name}{variants}",
  "variants": ", with some variants: {variants}",
  "no_variants": ", with no variants",
  "protein_variants": ", leading to protein-level changes: {protein_variants}",
  "reflection_template": {
    "intro": {
      "general": "NEXUS personalized health at ETH Zurich presents a LEGO DNA sequencing demo, where guests are building LEGO stacks, which are scanned and interpreted as DNA sequences. {username} just sequenced the following read:\n{seq}",
      "examples": "As part of an educational demo presented by NEXUS personalized health of ETH Zurich, {username} just sequenced the following cDNA fragment:\n{seq}"
    },
    "domains": ", specifically a part of the {domains} domain",
    "examples": {
      "general": "Surprisingly, a BLAST search shows similarities to genetic material from the following species: {species}.",
      "egfr": "In fact, the sequence aligns to {gene}{domain_phrase}. This gene often carries activating substitutions like **p.G719S** in exon 18, or small deletions in exon 19 that keep the kinase switched 'on'.",
      "cftr": "In fact, the sequence aligns to {gene}{domain_phrase}, where even single-letter changes can cause cystic fibrosis. For example, **p.G551D** creates a channel that opens too rarely, while **p.R553*** truncates the protein entirely.",
      "warfarin": "In fact, the sequence aligns to the {gene}{domain_phrase} gene, which influences how people respond to warfarin. Variants like **VKORC1 p.V29L** can shift vitamin K recycling, while **CYP2C9 p.I359L** or **p.D360E** slow drug breakdown — making standard doses either too strong or too weak.",
      "sars2_rbd":"In fact, the sequence aligns to the SARS‑CoV‑2 spike protein {gene}{domain_phrase}. In wastewater, small RNA fragments carry mutational 'fingerprints'—patterns like **E484Q** or **S477N/S477G**. **E484Q** tends to point toward **Kappa‑like** viruses (B.1.617.1), while **S477N** is characteristic of **Iota‑like** lineages (B.1.526); **S477G** is less distinctive on its own and needs additional markers. With these fingerprints, we can often classify the virus even before clinical genomes confirm it."
    },
    "variants": "In this case, the sequence contains notable variants: {variants}. {protein_phrase}",
    "no_variants": "In this case, the read corresponds to the canonical sequence.",
    "sars_protein_variants": "These mutations form a fingerprint: {variants}.",
    "protein_variants": "At the protein level, this results in amino acid changes: {variants}.",
    "no_protein_variants": "These variants do not alter the protein sequence.",
    "role": {
        "general": "Now, imagine you're a scientist, explaining what this curious finding might suggest.\nWrite a light-hearted reflection—part scientific musing, part humorous speculation, at most 5 sentences.\nFocus mainly on the surprising mix of species in the BLAST hits, and the odd connections they might suggest.\nIf it fits naturally, you may include up to one playful nod each to Switzerland, ETH Zurich, or to potential personalized-health-related NEXUS projects — but only when the species inspire it.\nThe tone should be thoughtful, slightly whimsical, and accessible to the general public.\nAvoid fantasy storytelling, but feel free to make playful leaps in logic that spark curiosity.",
        "examples": "Now, imagine you're a scientist, explaining what this curious finding might suggest.\nWrite a scientific reflection, at most 5 sentences.\nFocus on what this specific sequence and its variants imply, not the sequencing setup.\nRemember this is for an educational demo, so keep the tone clear, thoughtful, and accessible to the general public."
    }
  }
}