{
  "missing_params": "Missing required parameters",
  "not_a_sequence": "Eh, somehow we did not get a DNA sequence string, but {seq}. No worries—it’s not you, it’s us!",
  "rate_limit": "Oops! Our storytelling AI needs a short break. Too many requests came in, and we hit the free usage limit. Try again in a moment!",
  "connection_error": "Uh-oh! We lost connection to our AI story generator. Please check the internet or try again in a few seconds.",
  "bad_request": "Hmm, something about this LEGO sequence confused our system. (Technical note: {error})",
  "auth_error": "Looks like our AI key card didn’t work—authentication failed. We’ll need a human to look into this.",
  "api_error": "Our AI storyteller is having a moment. (Server error: {error}) Please try again soon.",
  "unexpected_error": "Something unexpected happened. No worries—it’s not you, it’s us! (Error: {error})",
  "blast_cached": "Sequence found in cache, returning it.",
  "waiting_for_results": "Waiting {} seconds for BLAST results for {} to be ready...",
  "timeout": "Timeout of %d seconds reached while waiting for results",
  "not_ready": "Not ready, trying again in %d seconds (%d seconds so far)...",
  "no_hits_found": "No hits found",
  "examples_search_term": "{gene} variants",
  "blast_started": "BLAST started, waiting for results...",
  "blast_example": "Hey, that looks familiar! Your read seems to align to  {name}, with some variants: {variants}",
  "reflection_template": "As part of the 10th anniversary celebration of NEXUS personalized health at ETH Zurich, we’re showcasing a playful demo using a LEGO EV3-based DNA sequencer.\n\n{username}, a guest of the anniversary party, just built a LEGO stack, and the sequencer interpreted the colors into this DNA sequence:\n{seq}\n\n{example}\n\nNow, imagine you're a scientist, explaining what this curious finding might suggest.\nWrite a light-hearted reflection—part scientific musing, part humorous speculation, at most 5 sentences.\nYou can speculate about the origin of the sequence, somewhere in the Zürich area, or Switzerland.\nThe tone should be thoughtful, slightly whimsical, and accessible to the general public.\nAvoid fantasy storytelling, but feel free to make playful leaps in logic that spark curiosity.",
  "examples": {
    "general": "Surprisingly, a BLAST search shows similarities to genetic material from the following species: {species}.",
    "egfr": "In fact, the sequence aligns to the EGFR gene, specifically within the kinase domain hotspot covering exons 18–19. This region often harbors clinically relevant variants such as: • G719X (G719A/C/S) in exon 18 — a substitution in the ATP-binding site that can subtly activate signaling, • E709K or E709_T710delinsD — hinge-position changes that affect the switch mechanism, • Canonical exon 19 deletions (e.g., E746_A750del, L747_A750insP, L747_T751del) — small loop trims that favor the 'on' state of the kinase. In this case, the sequence contains notable variants: {variants}. At the protein level, the observed sequence ({aa_seq_q}) differs from the reference ({aa_seq_r}), starting at amino acid position {aa_offset}. Such alterations are known to influence EGFR signaling and drug sensitivity, making them both a diagnostic clue and a therapeutic hint.",
    "cftr": "In fact, the sequence aligns to the CFTR gene, mutations of which cause cystic fibrosis — a condition where disrupted chloride transport leads to thick mucus, chronic infections, and multi-organ complications. Within a narrow stretch of exon 10, multiple nearby mutations can cause cystic fibrosis in different ways: • Folding defects (ΔF508-like) — the protein misfolds and never reaches the cell surface, • Gating defects (G551D-like) — the protein is present but opens too rarely, • Splice-altering variants — the protein is produced at much lower levels or not at all. In this case, the sequence contains notable variants: {variants}. At the protein level, the observed sequence ({aa_seq_q}) differs from the reference ({aa_seq_r}), starting at amino acid position {aa_offset}. Such alterations can shift CFTR from well-folded and functional to misfolded, absent, or present-but-reluctant to open. Therapies are now tailored to the mutation class — for example, correctors to improve folding or potentiators to enhance gating — making CFTR a prime example of precision medicine in action.",
    "warfarin": "In fact, the sequence aligns to the {gene} gene, which plays a key role in determining individual sensitivity to the anticoagulant drug warfarin. Variants in VKORC1 (aa 28–46) can alter the vitamin K epoxide reductase complex, affecting clotting factor activation. Variants in CYP2C9 (aa 355–363) can change the metabolism rate of warfarin itself, influencing how long the drug remains active in the body. In this case, the sequence contains notable variants: {variants}. At the protein level, the observed sequence ({aa_seq_q}) differs from the reference ({aa_seq_r}), starting at amino acid position {aa_offset}. Such changes can make a standard warfarin dose either too strong (risking bleeding) or too weak (risking clot formation), underscoring why genotype-guided dosing is now part of precision anticoagulation therapy.",
    "sars2_rbd": "In fact, the sequence aligns to the SARS-CoV-2 spike protein, specifically the receptor-binding domain (RBD), a hotspot for mutations that influence binding to the ACE2 receptor and antibody recognition. Wastewater surveillance detects SARS-CoV-2 RNA fragments shed by infected individuals, and because these genomes are pooled and often degraded, targeted sequencing of key sites like the RBD is essential. Mutations here can vary in their functional impact — for example, K417T/N, L452R/Q, E484K/Q, F490S, N501Y — but when seen together, they form a distinct 'fingerprint' that can identify a variant even from fragmented data. In this case, the sequence contains notable mutations: {variants}. Common RBD mutation fingerprints (aa 417–554) include: • Alpha (B.1.1.7): N501Y • Beta (B.1.351): K417N, E484K, N501Y • Gamma (P.1): K417T, E484K, N501Y • Delta (B.1.617.2): L452R, T478K • Omicron (BA.1): G339D, S371L, S373P, S375F, K417N, N440K, G446S, S477N, T478K, E484A, Q493R, G496S, Q498R, N501Y, Y505H • Mu (B.1.621): R346K, E484K, N501Y • Iota (B.1.526): E484K • Lambda (C.37): L452Q, F490S. At the protein level, the observed sequence ({aa_seq_q}) differs from the reference ({aa_seq_r}), starting at amino acid position {aa_offset}. Such fingerprints allow tracking of co-circulating variants in wastewater, helping detect emerging strains before they appear in clinical sequencing data."
  }
}