[
  {
    "title": "How Much DNA in NEXUS?",
    "fact": "Did you know: The combined genome of all 26 Nexians adds up to over 80 billion base pairs — enough to build a LEGO tower over 550,000 km tall!"
  },
  {
    "title": "From Earth to the Moon — in Bricks",
    "fact": "Did you know: If you stacked one LEGO brick for every base pair in all Nexian genomes, you could reach the moon - and half way back!"
  },
  {
    "title": "NEXUS Conference, LEGO Edition",
    "fact": "Did you know: Over 2 days of a NEXUS conference, our LEGO robot could read more than 170,000 bricks — that’s about the size of TTN, the largest human gene"
  },
  {
    "title": "How Fast is Illumina?",
    "fact": "Did you know: An Illumina NovaSeq can sequence 48 human genomes in 2 days — the LEGO sequencer would need about 4,700 years to catch up!"
  },
  {
    "title": "LEGO Genome Distance",
    "fact": "Did you know: A single human genome, built from LEGO bricks, would stretch about 20,000 km — that’s half of the way around the Earth!"
  },
  {
    "title": "ETH to Orbit — in DNA Bricks",
    "fact": "Did you know: The LEGO stack for a single Nexian's genome would reach over 21,000 km — high enough to pass the International Space Station 20 times!"
  },
  {
    "title": "Lake Zurich Full of Bricks",
    "fact": "Did you know: If you laid out all the Nexian DNA bricks side-by-side, it would cover over 20 square kilometers — that's almost half the area of Lake Zurich!"
  },
  {
    "title": "LEGO vs 10 Years of NEXUS",
    "fact": "Did you know: In the 10 years since NEXUS was founded, the LEGO sequencer could only read about 10% of a single human genome!"
  },
  {
    "title": "DNA Backpack Challenge",
    "fact": "Did you know: If each base pair in the NEXUS team’s DNA were a LEGO brick, you'd nearly fill the entire atrium of the ETH Main Building — from floor to dome!"
  },
  {
    "title": "DNA Built From LEGO... Earth-Sized?",
    "fact": "Did you know: A human body has around 37 trillion cells — and if you rebuilt all that DNA using LEGO bricks, you'd need the DNA of just 1,860 people to match the volume of the entire Earth!"
  },
 {
    "title": "DNA Bricks for a Whole Human",
    "fact": "Did you know: If you built the DNA from every cell in your body using LEGO bricks, it would take LEGO over 6.5 trillion years to produce enough — that’s nearly 500 times the age of the universe!"
  },
  {
    "title": "One Genome, Please",
    "fact": "Did you know: LEGO could produce enough bricks to build a complete human genome in just 66 days!"
  },
  {
    "title": "Sequencing Bacteria with LEGO",
    "fact": "Did you know: Sequencing a small bacterial genome like E. coli — about 1.25 million base pairs — would take the LEGO sequencer 14.5 days. The tower would stretch all the way from Schlieren to ETH Hönggerberg!"
  }
]
