[
  {
    "title": "How Much DNA in NEXUS?",
    "fact": "The combined genome of all 26 Nexians adds up to over 80 billion base pairs — enough to build a LEGO tower over 550,000 km tall!"
  },
  {
    "title": "From Earth to the Moon — in Bricks",
    "fact": "If you stacked one LEGO brick for every base pair in all Nexian genomes, you could reach the moon - and half way back!"
  },
  {
    "title": "NEXUS Conference, LEGO Edition",
    "fact": "Over 2 days of a NEXUS conference, our LEGO robot could read more than 170,000 bricks — that’s about the size of TTN, the largest human gene"
  },
  {
    "title": "How Fast is Illumina?",
    "fact": "An Illumina NovaSeq can sequence 48 human genomes at 20x coverage in just 2 days — the LEGO sequencer would need almost 200,000 years to catch up!"
  },
  {
    "title": "LEGO Genome Distance",
    "fact": "A single human genome, built from LEGO bricks, would stretch about 20,000 km — half of the way around the Earth!"
  },
  {
    "title": "Lake Zurich Full of Bricks",
    "fact": "If you laid out all the Nexian genomes as LEGO bricks side-by-side, it would cover over 20 square kilometers — that's almost half the area of Lake Zurich!"
  },
  {
    "title": "LEGO vs 10 Years of NEXUS",
    "fact": "In the 10 years since NEXUS was founded, the LEGO sequencer could only read about 10% of a single human genome!"
  },
  {
    "title": "Drowned in LEGO Bricks",
    "fact": "If each base pair in the NEXUS team’s DNA were a LEGO brick, you'd nearly fill the entire atrium of the ETH Main Building — from floor to dome!"
  },
  {
    "title": "DNA Built From LEGO... Earth-Sized?",
    "fact": "A human body has around 37 trillion cells — and if you rebuilt all that DNA using LEGO bricks, you'd need the DNA of just 1,860 people to match the volume of the entire Earth!"
  },
 {
    "title": "DNA Bricks for a Whole Human",
    "fact": "If you wanted to build the DNA from every cell in your body using LEGO bricks, it would take LEGO over 6.5 trillion years to produce enough — that’s nearly 500 times the age of the universe!"
  },
  {
    "title": "One Genome, Please",
    "fact": "LEGO could produce enough bricks to build a complete human genome in just 66 days!"
  },
  {
    "title": "Sequencing Bacteria with LEGO",
    "fact": "Sequencing a small bacterial genome like E. coli — about 1.25 million base pairs — would take the LEGO sequencer 14.5 days. The tower would stretch all the way from ETH main building to SWS in Schlieren and from there to ETH Hönggerberg!"
  },
  {
    "title": "Long Reads are Really Long",
    "fact": "Some long-read sequencers can read up to 2 million DNA bases in one go — that’s like a LEGO stack to the stratosphere!"
  },
  {
    "title": "Marathon in a Minute",
    "fact": "The small Illumina MiSeq reads about 74,000 base pairs per second — if each were a LEGO brick, it could sequence a full marathon distance in just one minute!"
  },
  {
    "title": "LEGO vs DNA Synthesis",
    "fact": "Synthesizing a custom DNA strand 1 million bases long costs about $100,000 — the same as buying 1 million LEGO bricks!"
  }
]
